{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Embedding",
      "config": {
        "name": "embedding_1",
        "trainable": true,
        "batch_input_shape": [
          null,
          null
        ],
        "dtype": "float32",
        "input_dim": 4000,
        "output_dim": 50,
        "embeddings_initializer": {
          "class_name": "RandomUniform",
          "config": {
            "minval": -0.05,
            "maxval": 0.05,
            "seed": null
          }
        },
        "embeddings_regularizer": null,
        "activity_regularizer": null,
        "embeddings_constraint": null,
        "mask_zero": true,
        "input_length": null
      }
    },
    {
      "class_name": "LSTM",
      "config": {
        "name": "lstm_1",
        "trainable": true,
        "return_sequences": true,
        "return_state": false,
        "go_backwards": false,
        "stateful": false,
        "unroll": false,
        "units": 300,
        "activation": "tanh",
        "recurrent_activation": "hard_sigmoid",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "recurrent_initializer": {
          "class_name": "Orthogonal",
          "config": {
            "gain": 1.0,
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "unit_forget_bias": true,
        "kernel_regularizer": null,
        "recurrent_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "recurrent_constraint": null,
        "bias_constraint": null,
        "dropout": 0.5,
        "recurrent_dropout": 0.1,
        "implementation": 1
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "rate": 0.5,
        "noise_shape": null,
        "seed": null
      }
    },
    {
      "class_name": "MeanOverTime",
      "config": {
        "name": "mean_over_time_1",
        "trainable": true,
        "mask_zero": true
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_1",
        "trainable": true,
        "units": 1,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "sigmoid"
      }
    }
  ],
  "keras_version": "2.1.4",
  "backend": "tensorflow"
}